namespace TestProject
{
	public class TestLessonEight
	{
		/// <summary>
		/// Для объекта, находящегося в точке (12, 5) и движущегося со скоростью (-7, 3) движение меняет положение объекта на (5, 8)
		/// </summary>
		[Fact]
		public void Test1()
		{
			
		}

		/// <summary>
		/// Попытка сдвинуть объект, у которого невозможно прочитать положение в пространстве, приводит к ошибке
		/// </summary>
		[Fact]
		public void Test2()
		{

		}

		/// <summary>
		/// Попытка сдвинуть объект, у которого невозможно прочитать значение мгновенной скорости, приводит к ошибке
		/// </summary>
		[Fact]
		public void Test3()
		{

		}

		/// <summary>
		/// Попытка сдвинуть объект, у которого невозможно изменить положение в пространстве, приводит к ошибке
		/// </summary>
		[Fact]
		public void Test4()
		{

		}
	}
}